Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.UnableToUpgradeAnalyticalElementGeometry Property
 Unable to upgrade analytical element with incorrect geometry. To keep the elements, open Revit 2022 and correct the elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToUpgradeAnalyticalElementGeometry { get; }
Public Shared ReadOnly Property UnableToUpgradeAnalyticalElementGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToUpgradeAnalyticalElementGeometry {
	FailureDefinitionId^ get ();
}
static member UnableToUpgradeAnalyticalElementGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace